export const ru = {
  translation: {
    page_load: 'Страница загружается...',
    back: 'Назад',
    sidebar: {
      profile: 'Профиль',
      home: 'Главная',
      chats: 'Чаты',
    },
    auth: {
      reg: {
        _: 'Зарегистрироваться',
      },
      log: {
        _: 'Войти',
      },
    },
    posts: {
      latest: 'Последние посты',
      at: 'в',
      comment: 'Напишите комментарий первыми',
      dropdown: {
        edit: 'Редактировать пост',
        delete: 'Удалить пост',
        copy: 'Скопировать',
      },
    },
    chats: {
      _: 'Чаты',
      photo: '[ФОТО]',
      dropdown: {
        delete: 'Удалить чат',
      },
      window: {
        start: 'Тут начался ваш чат с ',
        pin: 'Закрепленное сообщение',
        message: 'Сообщение',
        input: 'Введите сообщение',
        contextMenu: {
          reply: 'Ответить',
          copy: 'Скопировать',
          pin: 'Закрепить',
          unpin: 'Открепить',
          edit: 'Редактировать',
          delete: 'Удалить',
        },
      },
    },
    profile: {
      user_block: {
        description: 'Описание',
        friends: {
          _: 'Друзья',
          modal: {
            _: 'Друзья {{name}}',
            dropdown: {
              friends: 'Друзья',
              outReq: 'Отправленные заявки',
              incReq: 'Входящие заявки',
            },
          },
        },
      },
      posts: {
        _: 'Посты {{name}}',
        add_post: {
          text: 'Вы можете публиковать посты',
          btnText: 'Создать',
          rule: 'Правила контента',
          modal: {
            content: 'Введите содержимое поста',
            tags: 'Теги',
            send: 'Опубликовать',
          },
        },
      },
    },
    settings: {
      safety: {
        _: 'Безопасность',
        pass: {
          _: 'Изменить пароль',
          currPass: 'Введите текущий пароль',
          newPass: 'Введите новый пароль',
          btn: 'Изменить',
        },
        exit: {
          _: 'Выйти из аккаунта',
          btn: 'Выйти',
        },
        delete: {
          _: 'Удалить аккаунт',
          btn: 'Удалить',
        },
      },
      visual: {
        _: 'Вид',
        font_size: 'Размер шрифта',
        theme: {
          _: 'Тема',
          dark: 'Темная',
          light: 'Светлая',
          btn: 'Изменить',
        },
        lang: {
          _: 'Язык',
          btn: 'Изменить',
        },
      },
      profile: {
        _: 'Профиль',
        avatar: 'Аватар',
        name: { _: 'Ваше имя', btn: 'Изменить' },
        description: {
          _: 'Ваше описание',
          btn: 'Изменить',
        },
      },
      privacy: {
        _: 'Приватность',
        vis: 'Видно',
        hid: 'Скрыто',
        type: { _: 'Тип аккаунта', btn: 'Изменить', pub: 'Public', pri: 'Private' },
        name: { _: 'Видимость имени', btn: 'Изменить' },
        friends: { _: 'Видимость друзей', btn: 'Изменить' },
      },
    },
  },
}
